[{
    "course_id": 1,
    "img": "https://wallpapercave.com/wp/wp7133223.png",
    "total_video": 540,
    "course_duration": 6,
    "assignment": 12,
    "description": "Python is a high-level, general-purpose programming language. Its design philosophy emphasizes code readability with the use of significant indentation. Python is dynamically-typed and garbage-collected. It supports multiple programming paradigms, including structured, object-oriented and functional programming.",
    "topics": [
      "You will master the Python programming language by building 100 unique projects over 100 days.",
      "You will be able to program in Python professionally",
      "Create a portfolio of 100 Python projects to apply for developer jobs",
      "Be able to use Python for data science and machine learning",
      "Build GUIs and Desktop applications with Python",
      "You will learn automation, game, app and web development, data science and machine learning all using Python.",
      "You will learn Selenium, Beautiful Soup, Request, Flask, Pandas, NumPy, Scikit Learn, Plotly, and Matplotlib.",
      "Be able to build fully fledged websites and web apps with Python",
      "Includes Quizzes, Live Coding Exercises, Challenge Coding Exercises and Assignments",
      "Build games like Blackjack, Pong and Snake using Python"
    ],
    "course_name": "Python",
    "ratting": 4.4,
    "price": 120,
    "total_rettings": 2400,
    "total_sells": 3000,
    "discount": 18
  }, {
    "course_id": 2,
    "img": "https://res.cloudinary.com/practicaldev/image/fetch/s--WPQ75f2s--/c_imagga_scale,f_auto,fl_progressive,h_420,q_auto,w_1000/https://dev-to-uploads.s3.amazonaws.com/uploads/articles/epv55hgtsfi8csprpj9u.jpg",
    "total_video": 800,
    "course_duration": 6,
    "assignment": 20,
    "description": "MEAN is a free and open-source JavaScript software stack for building dynamic web sites and web applications. A variation known as MERN replaces Angular with React",
    "topics": [
        "Build Income & ExpensesTracker App using MERN STACK",
        "Master Node JS module system",
        "Build Task Manager App using html, css and javascript",
        "Build Image Gallery App using Node js and mongodb and Cloudinary",
        "Use NodeJS to write server-side JavaScript",
        "Use Postman to develop and test APIs",
        "Use NPM to install all sorts of useful packages",
        "Master Database relationship",
        "Master Asynchronous programming in JS",
        "Includes Quizzes, Live Coding Exercises, Challenge Coding Exercises and Assignments",
        "And More Intaresting Topices ..."

    ],
    "course_name": "MERN Stack Development",
    "ratting": 4.7,
    "price": 100,
    "total_rettings": 1800,
    "total_sells": 2400,
    "discount": 15
  }, {
    "course_id": 3,
    "img": "https://ubiqum.com/assets/uploads/2019/10/screenshot-2021-02-11-at-115416.png",
    "total_video": 300,
    "course_duration": 3,
    "assignment": 15,
    "description": "Java is a high-level, class-based, object-oriented programming language that is designed to have as few implementation dependencies as possible.",
    "topics": [
      "Learn the core Java skills needed to apply for Java developer positions in just 74 hours.",
      "Be able to demonstrate your understanding of Java to future employers.",
      "Acquire essential java basics for transitioning to the Spring Framework, Java EE, Android development and more.",
      "Be able to sit for and pass the Oracle Java Certificate exam if you choose.",
      "Learn industry best practices in Java software development from a professional Java developer who has worked in the language for 18 years.",
      "Includes Quizzes, Live Coding Exercises, Challenge Coding Exercises and Assignments",
      "Obtain proficiency in Java 8 and Java 11."
      
    ],
    "course_name": "java",
    "ratting": 4.6,
    "price": 170,
    "total_rettings": 2000,
    "total_sells": 2950,
    "discount": 17
  }, {
    "course_id": 4,
    "img": "https://www.nicepng.com/png/detail/111-1116276_computer-science-i-syllabus-and-grading-policy-c.png",
    "total_video": 778,
    "course_duration": 6,
    "assignment": 18,
    "description": "C++ is a high-level general-purpose programming language created by Danish computer scientist Bjarne Stroustrup as an extension of the C programming language, ",
    "topics": [
          "Learn to program with one of the most powerful programming languages that exists today, C++.",
          "Obtain the key concepts of programming that will also apply to other programming languages",
          "Learn Modern C++ rather than an obsolete version of C++ that most other courses teach",
          "Learn C++ features from basic to more advanced such as inheritance and polymorphic functions",
          "Includes Quizzes, Live Coding Exercises, Challenge Coding Exercises and Assignments",
          "New Section: Learn to use Visual Studio Code with C++",
          "New Section: Learn all about using C++ Lambda Expressions"
    ],
    "course_name": "c++",
    "ratting": 3.9,
    "price": 80,
    "total_rettings": 2600,
    "total_sells": 4000,
    "discount": 10
  }, {
    "course_id": 5,
    "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Unofficial_JavaScript_logo_2.svg/512px-Unofficial_JavaScript_logo_2.svg.png",
    "total_video": 492,
    "course_duration": 3,
    "assignment": 10,
    "description": "JavaScript, often abbreviated as JS, is a programming language that is one of the core technologies of the World Wide Web, alongside HTML and CSS. As of 2022, 98% of websites use JavaScript on the client side for webpage behavior, often incorporating third-party libraries",
    "topics": [
      "Become an advanced, confident, and modern JavaScript developer from scratch",
      "Build 6 beautiful real-world projects for your portfolio (not boring toy apps)",
      "Become job-ready by understanding how JavaScript really works behind the scenes",
      "How to think and work like a developer: problem-solving, researching, workflows",
      "JavaScript fundamentals: variables, if/else, operators, boolean logic, functions, arrays, objects, loops, strings, etc.",
      "Modern ES6+ from the beginning: arrow functions, destructuring, spread operator, optional chaining (ES2020), etc.",
      "Complex concepts like the 'this' keyword, higher-order functions, closures, etc.",
      "Asynchronous JavaScript: Event loop, promises, async/await, AJAX calls and APIs",
      "Practice your skills with 50+ challenges and assignments (solutions included)",
      "Course pathways: design your unique learning path according to your goals!",
      "Get fast and friendly support in the Q&A area"
    ],
    "course_name": "javasSript",
    "ratting": 4.8,
    "price": 110,
    "total_rettings": 3010,
    "total_sells": 4700,
    "discount": 20
  }, {
    "course_id": 6,
    "img": "https://www.nixsolutions.com/uploads/2020/07/Golang.png",
    "total_video": 500,
    "course_duration": 6,
    "assignment": 17,
    "description": "Go is a statically typed, compiled programming language designed at Google by Robert Griesemer, Rob Pike, and Ken Thompson. It is syntactically similar to C, but with memory safety, garbage collection, structural typing, and CSP-style concurrency",
    "topics": [
     "The ultimate comprehensive course",
     "Taught by a university professor",
     "Concurrency, channels, benchmarking",
     "Hands-on exercises with solutions",
     "This course is tried, tested, and proven",
     "Lifetime course access",
     "For beginners and experienced devs",
     "Access to valuable code base",
     "Over 2.65 Million students taught"
     
    ],
    "course_name": "Go",
    "ratting": 4.2,
    "price": 90,
    "total_rettings": 1900,
    "total_sells": 2980,
    "discount": 15
  }]